cask_args appdir: '/Applications'

tap 'homebrew/bundle'

cask 'docker'

# Some core stuff
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'fop'
brew 'libtool'
brew 'unixodbc'
brew 'gettext'
brew 'wxwidgets'
brew 'gnupg'
brew 'unzip'
brew 'curl'
brew 'postgresql@15'
brew 'pyenv'
brew 'neovim'

# Git helpers
brew 'git'

# Programs
cask 'iterm2'
cask 'postman'
cask 'dash'
cask 'alfred'
cask 'zoom'
cask 'spotify'
cask 'tuple'
cask 'notion'
cask 'rectangle'
cask 'visual-studio-code'
cask 'slack'
cask 'obsidian'

# Other Utilities
cask 'ngrok'

# Shell utilities
brew 'thefuck'
brew 'zsh'
brew 'zsh-completions'
brew 'caddy'
brew 'swiftformat'
brew 'xcodes'
