cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Some core stuff
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'gettext'
brew 'wxmac'
brew 'gnupg'


# Git helpers
brew 'git'
brew 'git-flow'

# Programs
cask 'atom'
cask 'iterm2'

# Other Utilities
brew 'haproxy'
cask 'ngrok'

# Shell utilities
brew 'thefuck'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
